gastonfeng/bootloader_stm32/mFirmata.cpp
bool IS_PIN_DIGITAL(byte pin);

uint32_t PIN_TO_DIGITAL(byte pin);

bool IS_PIN_PWM(byte pin);

uint32_t PIN_TO_PWM(byte pin);

void mFirmata::setPinModeCallback(nStream *Fs, byte pin, int mode) {
    if (getPinMode(pin) == PIN_MODE_IGNORE)
        return;
#ifdef USE_FIRMATA_WIRE
    if (getPinMode(pin) == PIN_MODE_I2C && isI2CEnabled && mode != PIN_MODE_I2C)
    {
        // disable i2c so pins can be used for other functions
        // the following if statements should reconfigure the pins properly
        disableI2CPins();
    }
#endif
#ifdef USE_SERVO
    if (IS_PIN_DIGITAL(pin) && mode != PIN_MODE_SERVO && servoPinMap[pin] < MAX_SERVOS &&
        servos[servoPinMap[pin]].attached())
    {
        detachServo(pin);
    }
#endif
    if (IS_PIN_ANALOG(pin)) {
        reportAnalogCallback(Fs, PIN_TO_ANALOG(pin), mode == PIN_MODE_ANALOG ? 1 : 0); // turn on/off reporting
    }
    if (IS_PIN_DIGITAL(pin))
    {
        if (mode == INPUT || mode == PIN_MODE_PULLUP)
        {
            portConfigInputs[pin / 8] |= (1 << (pin & 7));
        }
        else
        {
            portConfigInputs[pin / 8] &= ~(1 << (pin & 7));
        }
    }
    setPinState(pin, 0);
    switch (mode)
    {
    case PIN_MODE_ANALOG:
        if (IS_PIN_ANALOG(pin))
        {
            if (IS_PIN_DIGITAL(pin))
            {
                //
            }
            setPinMode(pin, PIN_MODE_ANALOG);
        }
        break;
    case INPUT:
        if (IS_PIN_DIGITAL(pin))
        {
            setPinMode(pin, INPUT);
        }
        break;
    case PIN_MODE_PULLUP:
        if (IS_PIN_DIGITAL(pin)) {
            setPinMode(pin, PIN_MODE_PULLUP);
            setPinState(pin, 1);
        }
        break;
    case OUTPUT:
        if (IS_PIN_DIGITAL(pin))
        {
            if (getPinMode(pin) == PIN_MODE_PWM) {
                // Disable PWM if pin mode was previously set to PWM.
                digitalWrite(PIN_TO_DIGITAL(pin), LOW);
            }
            setPinMode(pin, OUTPUT);
        }
        break;
    case PIN_MODE_PWM:
        if (IS_PIN_PWM(pin))
        {
            analogWrite(PIN_TO_PWM(pin), 0);
            setPinMode(pin, PIN_MODE_PWM);
        }
        break;
#ifdef USE_SERVO

            case PIN_MODE_SERVO:
                if (IS_PIN_DIGITAL(pin))
                {
                    setPinMode(pin, PIN_MODE_SERVO);
                    if (servoPinMap[pin] == 255 || !servos[servoPinMap[pin]].attached())
                    {
                        // pass -1 for min and max pulse values to use default values set
                        // by Servo library
                        attachServo(fm, fs, pin, -1, -1);
                    }
                }
                break;
#endif
#ifdef USE_FIRMATA_WIRE
            case PIN_MODE_I2C:
                if (IS_PIN_I2C(pin))
                {
                    // mark the pin as i2c
                    // the user must call I2C_CONFIG to enable I2C for a device
                    setPinMode(pin, PIN_MODE_I2C);
                }
                break;
#endif
        case PIN_MODE_SERIAL:
#ifdef FIRMATA_SERIAL_FEATURE
            serialFeature->handlePinMode(this, pin, PIN_MODE_SERIAL);
#endif
            break;
        default:
            sendString(Fs, "Unknown pin mode");
    }
}

uint32_t PIN_TO_PWM(byte pin) {
    return 0;
}

bool IS_PIN_PWM(byte pin) {
    return false;
}

uint32_t PIN_TO_DIGITAL(byte pin) {
    return 0;
}

bool IS_PIN_DIGITAL(byte pin) {
    return false;
}

byte PIN_TO_ANALOG(byte pin) {
    return 0;
}

bool IS_PIN_ANALOG(byte pin) {
    return false;
}

#endif

int soem_scan(Stream *);

void mFirmata::analogWriteCallback(Stream *, byte i, int val) {
#if defined(RTE_APP) || defined(PLC)
    auto v = (u16) val;
    plcVar.analogValue(i, v);
#endif
}

#ifdef USE_LFS

#include "flashFs.h"

extern FlashFs flash_fs;
#endif

void mFirmata::stringCallback(nStream *Fs, char *myString) {
#ifdef USE_LFS
    if (strncmp(myString, "rm ", 3) == 0) {
        if (FlashFs::unlink(&myString[3]) == 0)
            sendString(Fs, "rm ok");
        else
            sendString(Fs, "rm fail");
    } else
#endif
        sendString(Fs, "unknown input");
}

int fill_dbg(int index, u8 *buf);

void set_dbg(u32 index, byte *varp, int len);

void writePort(byte port, byte i, byte mask);

int getPinMode(byte pin);

int getPinState(byte pin);

void mFirmata::sysexCallback(nStream *FirmataStream, byte command, uint16_t argc, byte *argv) {
    int index;
    int state;
    u32 start, end;
    u32 indexv;
    int len;
    u8 *data;
    tm new_time{};
    struct {
        u32 build;
        char name[8];
    } info{};
    // logger.debug("sysexCallback: %d argc=%d,argv=%p", command, argc, argv);
    switch (command) {
        case ARE_YOU_THERE:
#if defined(RTE_APP) || defined(PLC)
            // logger.disable(logger_t::LOGGER_SERIAL);
#endif
            FirmataStream->write(START_SYSEX);
            FirmataStream->write(I_AM_HERE);
            FirmataStream->write(1); // arduino_instance_id
            FirmataStream->write(END_SYSEX);
            FirmataStream->flush();
            break;
        case I_AM_HERE:
            break;
#if defined(RTE_APP) || defined(PLC)
        case SAMPLING_INTERVAL:
            if (argc > 1) {
                plc_var.info.samplingInterval = (byte) (argv[0] + (argv[1] << 7));
                if (plc_var.info.samplingInterval < plc_var.config.MINIMUM_SAMPLING_INTERVAL) {
                plc_var.info.samplingInterval = plc_var.config.MINIMUM_SAMPLING_INTERVAL;
            }
        }
        else
        {
            // sendString("Not enough data");
        }
        break;
    case REPORT_ANALOG:
        if (argc == 2) {
            reportAnalogCallback(FirmataStream, argv[0], argv[1]);
        }
        break;
    case EXTENDED_ANALOG:
        if (argc > 1) {
            int al = argv[1];
            if (argc > 2)
                al |= (argv[2] << 7);
            if (argc > 3)
                al |= (argv[3] << 14);
            analogWriteCallback(FirmataStream, argv[0], al);
        }
            break;
        case CAPABILITY_QUERY:
            FirmataStream->write(START_SYSEX);
            FirmataStream->write(CAPABILITY_RESPONSE);
            board.capability_query(this, FirmataStream);
            FirmataStream->write(END_SYSEX);
            FirmataStream->flush();
            break;
        case PIN_STATE_QUERY:
            if (argc > 0) {
                byte pin = argv[0];
                FirmataStream->write(START_SYSEX);
                FirmataStream->write(PIN_STATE_RESPONSE);
                FirmataStream->write(pin);
                if (pin < IO_YO_NRS + IO_XI_NRS) {
                    FirmataStream->write(getPinMode(pin));
                    FirmataStream->write((byte) getPinState(pin) & 0x7F);
                    if (getPinState(pin) & 0xFF80)
                        FirmataStream->write((byte) (getPinState(pin) >> 7) & 0x7F);
                    if (getPinState(pin) & 0xC000)
                        FirmataStream->write((byte) (getPinState(pin) >> 14) & 0x7F);
                }
                FirmataStream->write(END_SYSEX);
                FirmataStream->flush();
            }
            break;
        case ANALOG_MAPPING_QUERY:
            FirmataStream->write(START_SYSEX);
            FirmataStream->write(ANALOG_MAPPING_RESPONSE);
            board.analog_mapping_query(this, FirmataStream);

