gastonfeng/bootloader_stm32/mFirmata.cpp
        // port2 = *(uint16_t *) argv;
        //            kSerial::get_serial(port2)->set_low();
        break;
#endif
#if defined(RTE_APP) || defined(PLC)
    case FM_GET_TASK_NRS:
        sendSysex(FirmataStream, FM_GET_TASK_NRS, 1, &(plc_var.info.plc_task_cnt));
        break;
    case FM_GET_TASK_NAME:
        if (tasks[argv[0]]) {
            sendSysex(FirmataStream, FM_GET_TASK_NAME, (byte) strlen(tasks[argv[0]]->task_name),
                      (byte *) tasks[argv[0]]->task_name);
        }
        break;
    case FM_GET_TASK_DETAIL:
        if (argv[0] < PLC_TASK_NRS && tasks[argv[0]])
        {
            sendSysex(FirmataStream, FM_GET_TASK_DETAIL, 24, tasks[argv[0]]->mata());
        }
        break;
#endif
    case FM_GET_PLC_STATE:
        sendSysex(FirmataStream, FM_GET_PLC_STATE, 1, (byte *) (&plc_var.info.plc_state));
        break;
    case FM_GET_PLC_INFO:
        if (plc_var.info.plc_curr_app)
        {
            info.build = plc_var.info.plc_curr_app->buildnumber;
            strcpy(info.name, plc_var.info.plc_curr_app->app_name);
            sendSysex(FirmataStream, FM_GET_PLC_INFO, sizeof(info), (byte *) &info);
        } else
            sendSysex(FirmataStream, FM_GET_PLC_INFO, 0, (byte *) &info);
            break;
        case CB_GET_LOG_NUMBER:
            sendSysex(FirmataStream, CB_GET_LOG_NUMBER, 5, (byte *) (&plc_var.info.plc_state));
            break;
        case CB_GET_LOG:
            FirmataStream->write(START_SYSEX);
            FirmataStream->write(CB_GET_LOG);
            FirmataStream->write((uint8_t) 0);
            FirmataStream->write(END_SYSEX);
            FirmataStream->flush();
            break;
#ifdef USE_BOOTLOADER
        case CB_GET_BOOT_VERSION:
#ifdef BOOTINFO
            boot_t *b;
            b = (boot_t *) BOOTINFO; // platformio.ini中定义
            if (b)
                sendSysex(FirmataStream, CB_GET_BOOT_VERSION, sizeof(boot_t), (byte *) b);
            else
#endif
            {
                FirmataStream->write(START_SYSEX);
                FirmataStream->write(CB_GET_BOOT_VERSION);
                FirmataStream->write((uint8_t) 0);
                FirmataStream->write(END_SYSEX);
                FirmataStream->flush();
            }
        break;
    case FM_FLASH_BOOT:
        len = board.updateBootbin();
            sendSysex(FirmataStream, FM_FLASH_BOOT, len, (byte *) &len);
        break;
#endif

#ifdef USE_KVDB
    case FM_LIST_KEY:
        kvdb.list(this, FirmataStream);
        break;
    case CB_READ_KEY:
        size_t vlen;
        buffer = kvdb.get((const char *)argv);
        vlen = strlen(buffer);
        if (buffer && (vlen > 0))
            sendSysex(FirmataStream, CB_READ_KEY, (byte) vlen, (byte *) buffer);
        else
            sendSysex(FirmataStream, CB_READ_KEY, 0, (byte *) buffer);
        break;
    case FM_READ_KEY_BYTES:
        data = (u8 *)malloc(256);
            len = kvdb.get((const char *) argv, (char *) data + 4, 256, (u32 *) data);
            sendSysex(FirmataStream, FM_READ_KEY_BYTES, len + 4, (byte *) data);
            free(data);
        break;
    case CB_WRITE_KEY:
        size_t key_len;
            key_len = strlen((const char *) argv);
            int rw;
            rw = kvdb.set((const char *) argv, (const char *) argv + key_len + 1, (int) (argc - key_len - 2),
                          KV_STR_VALUE);
            sendSysex(FirmataStream, CB_WRITE_KEY, 4, (byte *) &rw);
            break;
        case FM_WRITE_KEY_BYTES:
            key_len = strlen((const char *) argv);
            uint32_t type;
            type = *(uint32_t *) (argv + key_len + 1);
            len = kvdb.set((const char *) argv, (const char *) (argv + key_len + 1 + 4),
                           (int) (argc - key_len - 1 - 4), type);
            sendSysex(FirmataStream, FM_WRITE_KEY_BYTES, 4, (byte *) &len);
            break;
        case CB_RM_KEY:
            kvdb.remove((const char *) argv);
            sendSysex(FirmataStream, CB_RM_KEY, 0, argv);
            break;
#endif
#ifdef USE_TSDB
        case CB_SET_TSL_RANGE:
            tsl_query q;
            key_len = strlen((const char *) argv);
            if (argc == key_len + 13) {
                start = *(u32 *) &argv[key_len + 1];
                end = *(u32 *) &argv[key_len + 1 + 4];
                state = (int) *(u32 *) &argv[key_len + 1 + 8];
                memset(&q, 0, sizeof(q));
                tsdb.query((const char *) argv, start, end, (fdb_tsl_status) (state), &q);
            }
            sendSysex(FirmataStream, CB_SET_TSL_RANGE, sizeof(tsl_query), (byte *) &q);
            break;
        case CB_SET_TSL_STATUS:
            key_len = strlen((const char *) argv);
        len = -1;
            if (argc == key_len + 13) {
                start = *(u32 *) &argv[key_len + 1];
                end = *(u32 *) &argv[key_len + 1 + 4];
                state = (int) *(u32 *) &argv[key_len + 1 + 8];
                len = tsdb.set_status((const char *) argv, start, end, (fdb_tsl_status) (state));
            }
            sendSysex(FirmataStream, CB_SET_TSL_STATUS, 4, (byte *) &len);
        break;
    case CB_GET_TSL:
        char *tbuf;
        int tlen;
        tbuf = (char *)malloc(256);
        memset(tbuf, 0, 256);
        tlen = tsdb.query_read((const char *)argv, (u32 *)&tbuf[0], (fdb_time_t *)&tbuf[4],
                               (int *)(tbuf + 8),
                               tbuf + 12, 256 - 12);
        if (tlen < 0)
            tlen = 0;
        else {
            *(u32 *) &tbuf[tlen] = GenerateCRC32Sum((const u8 *) tbuf, tlen, 0);
            tlen += 4;
        }
            sendSysex(FirmataStream, CB_GET_TSL, (byte) tlen, (byte *) tbuf);
            free(tbuf);
            break;
        case CB_GET_TSL_BY_ID:
            key_len = strlen((const char *) argv);
            if (argc != key_len + 5)
                return;
            tbuf = (char *) malloc(256);
            memset(tbuf, 0, 256);
            tlen = tsdb.query_read_by_id((const char *) argv, *(u32 *) argv[key_len + 1], (u32 *) &tbuf[0],
                                         (fdb_time_t *) &tbuf[4],
                                         (int *) (tbuf + 8),
                                         tbuf + 12, 256 - 12);
            if (tlen < 0)
                tlen = 0;
            else
        {
            *(u32 *)&tbuf[tlen] = GenerateCRC32Sum((const u8 *)tbuf, tlen, 0);
            tlen += 4;
        }
            sendSysex(FirmataStream, CB_GET_TSL_BY_ID, (byte) tlen, (byte *) tbuf);
            free(tbuf);
        break;
    case CB_TSL_CLEAR:
        key_len = strlen((const char *)argv);
        // index = *(int *) &argv[key_len + 1];

            sendSysex(FirmataStream, CB_TSL_CLEAR, (byte) sizeof(state), (byte *) &state);
            state = TSL::clear((const char *) (argv));
            break;
#endif
#ifdef USE_SOEM
            case FM_SOEM_SCAN:
                soem_scan(fm, FirmataStream);
                break;
#endif
#if defined(RTE_APP) || defined(PLC)
        case CB_SET_PLC_FILE:
            app.setPLCDLL((char *) argv);
            FirmataStream->write(START_SYSEX);
            FirmataStream->write(CB_SET_PLC_FILE);
            FirmataStream->write((uint8_t) 0);
            FirmataStream->write(END_SYSEX);
            FirmataStream->flush();
            break;
        case CB_CPU_USAGE:
            sendSysex(FirmataStream, CB_CPU_USAGE, 1, (byte *) &plc_var.info.cpu_usage);
            break;
#endif
#ifdef USE_WIFI
            case CB_WIFI_LIST:
                sendSysex(FirmataStream, CB_WIFI_LIST, plc_var.info.wifi_size, (byte *)&plc_var.info.wifi_list);
                break;
            case CB_WIFI_SET_PASS:
                int plen;
                plen = strlen((const char *)argv);
                //                kvdb.set("wifi_pass", (const char *)argv, plen);
                wifi.reload();
                sendSysex(FirmataStream, CB_WIFI_SET_PASS, 0, argv);
                break;
#endif
        case FM_PUT_DATA_BLOCK:
            u32 crc, crc_r;
            if (argc < 12)
                break;
            crc = GenerateCRC32Sum((const u8 *) argv, argc - 4, 0);
            crc_r = *(u32 *) (&argv[argc - 4]);
            if (crc_r != crc) {
                state = CRC_ERROR;
                logger.error("crc error block %d 0x%x 0x%x argc=%d len=%d", *(int *) &argv[0], crc, crc_r, argc,
                             argc);
            } else {
                rte.set_state(PLC_STATUS::APP_FLASH_BEGIN);
                int block = *(int *) &argv[0];
            if (block == 0)
            {
                // if (ifirmata.dev) {
                //     state = DEV_IS_OPEN;
                // } else
                {
                    u32 object = *(u32 *) &argv[4];
                    u32 data_address = *(u32 *) &argv[8];
                    u32 data_len = *(u32 *) &argv[12];

                    ifirmata.dev = mem_block::mems[object];
                    if (!ifirmata.dev) {
                        state = NO_DEVICE;
                    } else {
                        state = ifirmata.dev->begin(&argv[16], argc - 16, data_address, data_len);
                        if (state > 0 && state > ifirmata.dataBufferSize * 7 / 8 - 4) {
                            state = (int) (ifirmata.dataBufferSize * 7 / 8 - 4);
                        }
                        logger.info("recv %s ,size= %d", &argv[12], *(u32 *) &argv[8]);
                    }
                }
            }
            else if (block == -1)
            {
                if (ifirmata.dev)
                {
                    if (ifirmata.dev->Shutdown() < 0)
                    {
                        state = DEVICE_SHUTDOWN_ERR;
                    }
                    else
                    {
                        state = 1;
                        rte.set_state(PLC_STATUS::APP_FLASH_END);
                        logger.info("recv end.");
                        ifirmata.dev = nullptr;
                    }
                }
            }
            else
            {
                if (ifirmata.dev)
                {
                    if (ifirmata.dev->Write(&argv[4], argc - 8) < 0) {
                        state = DEVICE_WRITE_ERR;
                    } else {
                        state = block;
                    }
                    logger.info("recv %d ,size= %d", block, argc - 8);
                }
            }
        }
            sendSysex(FirmataStream, FM_PUT_DATA_BLOCK, 4, (byte *) &state);
        break;
#if defined(RTE_APP) || defined(PLC)
    case FM_GET_LOC_SIZE:
        if (plc_var.info.plc_curr_app)
        {
            sendSysex(FirmataStream, FM_GET_LOC_SIZE, 2, (byte *) &plc_var.info.plc_curr_app->l_sz);
        }
        else
        {
            sendSysex(FirmataStream, FM_GET_LOC_SIZE, 0, (byte *) &plc_var.info.plc_curr_app->l_sz);
        }
        break;
    case FM_GET_LOC_TAB:
        u32 l_index;
        if (argc == 5)
        {
            l_index = *(u32 *) &argv[0];
            if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->l_sz)
            {
                plc_loc_tbl_t loc = plc_var.info.plc_curr_app->l_tab[l_index];
                len = (int)sizeof(plc_loc_dsc_t) + loc->a_size + loc->v_size;
                buffer = (char *)malloc(len);
                buffer[0] = loc->v_type;
                buffer[1] = loc->v_size;
                *(u16 *)&buffer[2] = loc->proto;
                *(u16 *)&buffer[4] = loc->a_size;
                memcpy(&buffer[6], loc->a_data, loc->a_size);
                memcpy(&buffer[6 + loc->a_size], loc->v_buf, loc->v_size);
                sendSysex(FirmataStream, FM_GET_LOC_TAB, len, (byte *) buffer);
                free(buffer);
                break;
            }
        }
            sendSysex(FirmataStream, FM_GET_LOC_TAB, 0, (byte *) &plc_var.info.plc_curr_app->l_sz);
        break;
    case FM_SET_LOC_TAB:
        if (argc == 5)
        {
            l_index = *(u32 *) &argv[0];
            if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->l_sz) {
                sendSysex(FirmataStream, FM_SET_LOC_TAB, sizeof(plc_loc_tbl_t),
                          (byte *) &plc_var.info.plc_curr_app->l_tab[l_index]);
                break;
            }
        }
            sendSysex(FirmataStream, FM_SET_LOC_TAB, 0, (byte *) &plc_var.info.plc_curr_app->l_sz);
        break;
#endif
#ifdef ONLINE_DEBUG
    case FM_GET_DBG_SIZE:
        if (plc_var.info.plc_curr_app) {
            sendSysex(FirmataStream, FM_GET_DBG_SIZE, 4,
                      (byte *) &plc_var.info.plc_curr_app->data->size_dbgvardsc);
        }
        else
        {
            sendSysex(FirmataStream, FM_GET_DBG_SIZE, 0, nullptr);
        }
        break;
    case FM_GET_DBG:
        len = 0;
        if (argc == 5)
        {
            l_index = *(u32 *) &argv[0];
            if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->data->size_dbgvardsc)
            {
                len = (int) fill_dbg((int) l_index, argv);
            }
        }
            sendSysex(FirmataStream, FM_GET_DBG, len, argv);
        break;
    case FM_SET_DBG:
        len = 0;
        if (argc > 5)
        {
            l_index = *(u32 *) argv;
            if (plc_var.info.plc_curr_app && l_index < plc_var.info.plc_curr_app->data->size_dbgvardsc) {
                set_dbg(l_index, &argv[4], argc - 4);
                len = (int) fill_dbg((int) l_index, argv);
            }
        }
            sendSysex(FirmataStream, FM_GET_DBG, len, argv);
        break;
#endif
#if defined(RTE_APP) || defined(PLC)
    case FM_LOG_SET_LEVEL:
        plc_var.config.log_level = argv[0];
            sendSysex(FirmataStream, FM_LOG_SET_LEVEL, 1, &plc_var.config.log_level);
        break;
#endif
#ifdef ARDUINO_ARCH_STM32
    case FM_GET_CPU_SN:
        u32 sn[3];
        sn[0] = HAL_GetUIDw0();
        sn[1] = HAL_GetUIDw1();
            sn[2] = HAL_GetUIDw2();
            sendSysex(FirmataStream, FM_GET_CPU_SN, 12, (byte *) sn);
        break;
#endif
#if defined(RTE_APP) || defined(PLC)
    case FM_READ_MEM:
        indexv = 0;
        len = 0;
            if (argc == 6) {
                indexv = *(u32 *) argv;
                len = *(u16 *) &argv[4];
            }
            sendSysex(FirmataStream, FM_READ_MEM, len, (byte *) indexv);
        break;
    case FM_WRITE_MEM:
        if (argc > 6) {
            indexv = *(u32 *) argv;
            len = *(u16 *) &argv[4];
            for (int i = 0; i < len; ++i) {
                *((uint8_t *) indexv + i) = argv[6 + i];
            }
            sendSysex(FirmataStream, FM_WRITE_MEM, len, (byte *) indexv);
        }
        break;
    case FM_READ_VALUE:
        u8 region, typ;
        if (argc < 9)
            break;
        indexv = 0;
        len = 0;
            if (argc == 8 && argv[0] <= REGION_HOLDER) {
                region = argv[0];
                indexv = *(u32 *) &argv[1];
                if (indexv > 256)
                    indexv = 0;;
                typ = argv[5];
                len = *(u16 *) &argv[6];
                if (len > 256)
                    len = 0;
                argv[0] = region;
                argv[1] = typ;
                *(u32 *) &argv[2] = indexv;
                const char *p;
                switch (region) {
                    default:
                        p = (const char *) &plc_var.digitalValue;
                        break;
                    case REGION_XI:      // byte from 0
                    case REGION_DIGITAL: // digitalValue
                        memset(argv, 0, argc);
                        for (int i = 0; i < len; i++)
                {
                    if (plcVar.digitalValue(i + indexv))
                        argv[i / 8] |= (1 << (i % 8));
                }
                p = (const char *)argv;
                len = (len + 7) / 8;
                indexv = 0;
                break;
            case REGION_16: // analogValue
                p = (const char *)&plc_var.analogValue;
                break;
            case REGION_32: // analogValue32
                p = (const char *)&plc_var.analogValue32;
                break;
                    case REGION_HOLDER: // holdValue
                        p = (const char *) &plc_var.holdValue;
                        break;
                    case REGION_INFO:
                        p = (const char *) &plc_var.info;
                        break;
                    case REGION_CONFIG:
                        p = (const char *) &plc_var.config;
                        break;
                }
                memcpy(&argv[6], &p[indexv], len);
                sendSysex(FirmataStream, FM_READ_VALUE_REP, len + 6, (byte *) argv);
            }
        else
                sendSysex(FirmataStream, FM_READ_VALUE_REP, len, ((byte *) &plc_var) + indexv);
        break;
    case FM_WRITE_VALUE:
        if (argc > 7) {
            region = argv[0];
            indexv = *(u32 *) &argv[1];
            len = *(u16 *) &argv[5];
            char *p;
            switch (region) {
                default:
                    p = ((char *) &plc_var.digitalValue);
                    break;
                case REGION_XI:      // byte from 0
                case REGION_DIGITAL: // digitalValue
                    u8 v;
                    v = ((char *) &plc_var.digitalValue)[indexv / 8];
                    if (argv[7] == 1) {
                        argv[7] = v | (1 << (indexv % 8));
                    } else {
                        argv[7] = v & ~(1 << (indexv % 8));
                    }
                indexv = indexv / 8;
                len = (len + 7) / 8;
                p = ((char *)&plc_var.digitalValue);
                break;
            case REGION_16: // analogValue
                p = (char *)&plc_var.analogValue;
                break;
            case REGION_32: // analogValue32
                p = (char *)&plc_var.analogValue32;
                break;
                case REGION_HOLDER: // holdValue
                    p = (char *) &plc_var.holdValue;
                    break;
                case REGION_INFO:
                    p = (char *) &plc_var.info;
                    break;
                case REGION_CONFIG:
                    p = (char *) &plc_var.config;
                    break;
            }
            memcpy(p + indexv, &argv[7], len);
            sendSysex(FirmataStream, FM_WRITE_VALUE_REP, 7, (byte *) argv);
        }
        break;
    case FM_READ_BIT:
        indexv = 0;
        len = 0;
            if (argc == 6) {
                indexv = *(u32 *) argv;
                len = *(u16 *) &argv[4];
            }
            if (len > 0) {
                buffer = (char *) malloc(len / 8 + 6);
                *(u32 *) argv = indexv;
                buffer[4] = len;
                for (int i = 0; i < len; i++)
            {
                u8 b = plcVar.digitalValue(indexv + i);
                buffer[i / 8 + 5] |= b << (i % 8);
            }
                sendSysex(FirmataStream, FM_READ_BIT_REP, len / 8 + 6, (byte *) buffer);
                free(buffer);
        }
        break;
    case FM_WRITE_BIT:
        if (argc > 6) {
            indexv = *(u32 *) argv;
            len = *(u16 *) &argv[4];
            if (len < (argc - 6)) {
                for (int i = 0; i < len; i++) {
                    *(((uint8_t *) &plc_var) + indexv + i) = argv[6 + i];
                }
            }
            sendSysex(FirmataStream, FM_WRITE_VALUE_REP, len,
                      (byte *) ((uint8_t *) &plc_var) + indexv);
        }
        break;
#endif
    case FM_READ_VALUE_REP:
        if (argc > 0) {
            memcpy(valueBuf, argv, argc);
            valueLen = argc;
        }
        break;
    case FM_WRITE_VALUE_REP:
        if (argc > 0 && argc < 8)
        {
        }
        break;
    case FM_READ_BIT_REP:
        if (argc > 0 && argc < 16) {
            memcpy(valueBuf, argv, argc);
            valueLen = argc;
        }
        break;
    case FM_WRITE_BIT_REP:
        if (argc > 0 && argc < 8)
        {
        }
        break;
#ifdef RTE_APP
    case FM_GET_LOCATION:
        len = 0;
        byte *buf_fgl;
        buf_fgl = (byte *)malloc(32);
            if (argc >= 4) {
                len = board.get_input(argv[1], argv[2], argv[3], 0, buf_fgl);
            }
            sendSysex(FirmataStream, FM_GET_LOCATION, len, (byte *) buf_fgl);
            free(buf_fgl);
        break;
    case FM_SET_LOCATION:
        len = -1;
            if (argc >= 6) {
                len = board.set_output(argv[1], argv[2], argv[3], 0, &argv[5], argv[4]);
            }
            sendSysex(FirmataStream, FM_SET_LOCATION, 4, (byte *) &len);
        break;
    case CB_GOTO_IAP:
        sendSysex(FirmataStream, CB_GOTO_IAP, 0, nullptr);
        boardBase::goto_iap();
#endif
    case CB_RESET:
        len = 1;
            sendSysex(FirmataStream, CB_RESET, 4, (byte *) &len);
            boardBase::reset();
        hwboard::reset();
        break;
    default:
        len = -1;
        logger.error("sysexCallback: %d argc=%d,argv=%p", command, argc, argv);
            // sendSysex(FirmataStream, command, 4, (byte *) &len);
        break;
    }
    set_flag(command);
}

void digitalWriteCallback(mFirmata *fm, nStream *FirmataStream, byte port, int value) {
#if defined(RTE_APP) || defined(PLC)
    byte lastPin, pinValue, mask = 1, pinWriteMask = 0;

    if (port < IO_XI_NRS + IO_YO_NRS) {
        // create a mask of the pins on this port that are writable.
        lastPin = port * 8 + 8;
        if (lastPin > IO_YO_NRS + IO_XI_NRS + IO_XA_NRS + IO_YA_NRS)
            lastPin = IO_YO_NRS + IO_XI_NRS + IO_XA_NRS + IO_YA_NRS;
#ifdef ARDUINO
        for (byte pin = port * 8; pin < lastPin; pin++)
        {
            // do not disturb non-digital pins (eg, Rx & Tx)
            if (IS_PIN_DIGITAL(pin) && (getPinMode(pin) == OUTPUT || getPinMode(pin) == INPUT)) {
                pinValue = ((byte) value & mask) ? 1 : 0;
                if (getPinMode(pin) == OUTPUT) {
                    pinWriteMask |= mask;
                } else if (getPinMode(pin) == INPUT && pinValue == 1 && getPinState(pin) != 1) {
                    // only handle INPUT here for backwards compatibility
#if ARDUINO > 100
                    // pinMode(pin, INPUT_PULLUP);
#else
                    // only write to the INPUT pin to enable pullups if Arduino v1.0.0 or earlier
                    pinWriteMask |= mask;
#endif
                }
                board.setPinState(fm, FirmataStream, pin, pinValue);
            }
            mask = (byte) (mask << 1);
        }
        writePort(port, (byte) value, pinWriteMask);
#endif
    }
#endif
}

int getPinState(byte pin) {
    return 0;
}

int getPinMode(byte pin) {
    return 0;
}

void writePort(byte port, byte i, byte mask) {
}

int mFirmata::loop(nStream *FirmataStream) {
    while (FirmataStream->available() > 0) {
        processInput(FirmataStream);
        plc_var.info.task_busy |= 0x2;
        last_tick = rtos::ticks();
    }
#if defined(RTE_APP) || defined(PLC)
    report(FirmataStream);
#endif
    return 0;
}

#if defined(RTE_APP) || defined(PLC)

void mFirmata::report(nStream *FirmataStream)
{
    u32 currentMillis = rtos::ticks();

