gastonfeng/bootloader_stm32/mFirmata.cpp
    if (currentMillis - previousMillis > plc_var.config.reportInterval)
    {
        previousMillis += plc_var.config.reportInterval;
        /* ANALOGREAD - do all analogReads() at the configured sampling interval */
        board.readAnalogValue(this, FirmataStream, plc_var.info.analogInputsToReport,
                              sizeof(plc_var.info.analogInputsToReport));
        for (byte pin = 0; pin < IO_XI_NRS + IO_YO_NRS; pin++)
        {
            if (plc_var.info.reportPINs[pin / 8] & (1 << (pin % 8)))
            {
                outputPort(FirmataStream, pin, getPinState(pin), true);
            }
        }
    }
#ifdef FIRMATA_SERIAL_FEATURE
    serialFeature->update(this, FirmataStream);
#endif
    // if (queryIndex > -1) {
    //     for (byte i = 0; i < queryIndex + 1; i++) {
    //         readAndReportData(Firmata, query[i].addr, query[i].reg, query[i].bytes, query[i].stopTX);
    //     }
    // }
}

#endif

void mFirmata::outputPort(nStream *FirmataStream, byte portNumber, byte portValue, byte forceSend)
{
    // pins not configured as INPUT are cleared to zeros
    //    portValue = portValue & portConfigInputs[portNumber];
    // only send if the value is different than previously sent
    if (portNumber < (IO_XI_NRS + IO_YO_NRS) &&
        (forceSend || (plc_var.info.previousPINs[portNumber / 8] & (1 << (portNumber % 8))) != portValue))
    {
        sendDigitalPort(FirmataStream, portNumber, portValue);
        FirmataStream->flush();
        if (portValue == 0)
        {
            plc_var.info.previousPINs[portNumber / 8] &= ~(1 << (portNumber % 8));
        }
        else
        {
            plc_var.info.previousPINs[portNumber / 8] |= (1 << (portNumber % 8));
        }
    }
}

#ifdef windows_x86
#include <pthread.h>
#include <minwindef.h>
#include <profileapi.h>
#include <sysinfoapi.h>
u32 ticks()
{
    static LARGE_INTEGER s_frequency;
    static BOOL s_use_qpc = QueryPerformanceFrequency(&s_frequency);
    if (s_use_qpc)
    {
        LARGE_INTEGER now;
        QueryPerformanceCounter(&now);
        return (1000LL * now.QuadPart) / s_frequency.QuadPart;
    }
    //    else {
    //        return GetTickCount();
    //    }
}
void Delay(u32 ms)
{
    struct timespec interval
    {
    };
    interval.tv_nsec = ms * 1000000;
    pthread_delay_np(&interval);
}
#endif

int mFirmata::setValue(nStream *FirmataStream, int index, void *valBuf, u8 size)
{
    byte *buf;
    buf = (byte *)malloc(size + 4);
    *(int *)buf = index;
    memcpy(&buf[4], valBuf, size);
    clr_flag(FM_WRITE_VALUE_REP);
    sendSysex(FirmataStream, FM_WRITE_VALUE, size + 4, (byte *)buf);
    free(buf);
    u32 tick = rtos::ticks() + 1000;
    while (get_flag(FM_WRITE_VALUE_REP) == 0)
    {
        rtos::Delay(1);
        if (rtos::ticks() > tick)
            return TIMEOUT;
    }
    return 0;
}

int mFirmata::get_flag(u16 cmd)
{
    return respose[cmd / 8] & (1 << (cmd % 8));
}

int mFirmata::clr_flag(u16 cmd)
{
    respose[cmd / 8] &= ~(1 << (cmd % 8));
    return 0;
}

int mFirmata::set_flag(u16 cmd)
{
    if (cmd < FM_LAST)
    {
        respose[cmd / 8] |= (1 << (cmd % 8));
        return 0;
    }
    return -1;
}

int mFirmata::getValue(nStream *pStream, int index, u8 *value_buf, u16 len)
{
    u8 buf[6];
    *(int *)buf = index;
    *(u16 *)&buf[4] = len;
    clr_flag(FM_READ_VALUE_REP);
    valueLen = 0;
    sendSysex(pStream, FM_READ_VALUE, 6, (byte *)buf);
    u32 tick = rtos::ticks() + 1000;
    while (get_flag(FM_READ_VALUE_REP) == 0)
    {
        rtos::Delay(1);
        if (rtos::ticks() > tick)
            return TIMEOUT;
    }
    if (valueLen == len)
    {
        memcpy(value_buf, valueBuf, valueLen);
        return valueLen;
    }
    return -1;
}

int mFirmata::getBit(nStream *pStream, int index, u8 *value_buf, u16 len)
{
    u8 buf[6];
    *(int *)buf = index;
    *(u16 *)&buf[4] = len;
    clr_flag(FM_READ_BIT_REP);
    valueLen = 0;
    sendSysex(pStream, FM_READ_BIT, 6, (byte *)buf);
    u32 tick = rtos::ticks() + 1000;
    while (get_flag(FM_READ_BIT_REP) == 0)
    {
        rtos::Delay(1);
        if (rtos::ticks() > tick)
            return TIMEOUT;
    }
    if (valueLen == len)
    {
        for (int i = 0; i < len; i++)
        {
            value_buf[i] = (valueBuf[i / 8] & (1 << (i % 8))) ? 1 : 0;
        }
        return valueLen;
    }
    return -1;
}

int mFirmata::getPinState(byte pin)
{
    return plcVar.digitalValue(pin);
}

void mFirmata::setPinState(byte pin, int state)
{
    plcVar.digitalValue(pin, state);
}

void mFirmata::encodeByteStream(nStream *FirmataStream, size_t bytec, uint8_t *bytev, size_t max_bytes) {
    if (FirmataStream == nullptr) {
        return;
    }
    // logger.debug("encodeByteStream:%p bytec=%d,bytev=%p, max_bytes=%d", FirmataStream, bytec, bytev, max_bytes);
    static const size_t transmit_bits = 7;
    static const uint8_t transmit_mask = ((1 << transmit_bits) - 1);

    size_t bytes_sent = 0;
    size_t outstanding_bits = 0;
    uint8_t outstanding_bit_cache = *bytev;
    u16 crc = 0;
    u8 v;
    // if ((int) bytev < 0x30000000) {
    // logger.debug("encodeByteStream:%p bytec=%d,bytev=%p, max_bytes=%d", FirmataStream, bytec, bytev, max_bytes);
    //     return;
    // }

    if (max_bytes == 0) {
        max_bytes = FIRMATA_BUFFER_SZ;
    }
    if (bytec > max_bytes) {
        // logger.error("encodeByteStream: bytec %d > max_bytes %d", bytec, max_bytes);
        return;
    }
    for (size_t i = 0; (i < bytec) && (bytes_sent < max_bytes); ++i) {
        auto transmit_byte = (uint8_t) (outstanding_bit_cache | (bytev[i] << outstanding_bits));
        v = transmit_mask & transmit_byte;
        FirmataStream->write(v);
        crc = crc_16(&v, 1, crc);
        ++bytes_sent;
        outstanding_bit_cache = (bytev[i] >> (transmit_bits - outstanding_bits));
        outstanding_bits = (outstanding_bits + (8 - transmit_bits));
        while ((outstanding_bits >= transmit_bits) && (bytes_sent < max_bytes)) {
            transmit_byte = outstanding_bit_cache;
            v = transmit_mask & transmit_byte;
            FirmataStream->write(v);
            crc = crc_16(&v, 1, crc);
            ++bytes_sent;
            outstanding_bit_cache >>= transmit_bits;
            outstanding_bits -= transmit_bits;
        }
    }
    if (outstanding_bits && (bytes_sent < max_bytes)) {
        v = (uint8_t) ((1 << outstanding_bits) - 1) & outstanding_bit_cache;
        FirmataStream->write(v);
        crc = crc_16(&v, 1, crc);
    }
#ifdef FIRMATA_USE_CRC
    FirmataStream->write(crc & 0x7f);
    FirmataStream->write((crc >> 7) & 0x7f);
    FirmataStream->write((crc >> 14) & 0x7f);
#endif
}

void mFirmata::marshaller_sendSysex(nStream *FirmataStream, uint8_t command, size_t bytec, uint8_t *bytev) {
    assert(FirmataStream);
    if (bytec > FIRMATA_BUFFER_SZ) {
        //        core_debug("FirmataMarshaller byte limit");
        return;
    }
    if (FirmataStream->lock)
        rtos::mutex_lock(FirmataStream->lock);
    FirmataStream->flag |= FLAG_SYSEX;
    FirmataStream->write(START_SYSEX);
    FirmataStream->write(command);
    if (bytec > 0)
        encodeByteStream(FirmataStream, bytec, bytev, FIRMATA_BUFFER_SZ);

