gastonfeng/bootloader_stm32/mFirmata.cpp
    FirmataStream->write(END_SYSEX);
    FirmataStream->flush();
    if (FirmataStream->lock)
        rtos::mutex_unlock(FirmataStream->lock);
}

void mFirmata::sendSysex(nStream *FirmataStream, byte command, uint16_t bytec, byte *bytev) {
    if (use_sn) {
        auto *c = (byte *) malloc(bytec + 4);
        *(uint32_t *) c = sn;
        memcpy(c + 4, bytev, bytec);
        marshaller_sendSysex(FirmataStream, command, bytec + 4, c);
    } else {
        marshaller_sendSysex(FirmataStream, command, bytec, bytev);
    }
}

void mFirmata::processInput(nStream *FirmataStream) {
    int inputData = FirmataStream->read(); // this is 'int' to handle -1 when no data
    if (inputData != -1) {
        parse(FirmataStream, (uint8_t) inputData);
    }
}

void mFirmata::sendDigitalPort(nStream *FirmataStream, uint8_t portNumber, uint16_t portData) {
    FirmataStream->write(DIGITAL_MESSAGE | (portNumber & 0xF));
    // Tx bits  0-6 (protocol v1 and higher)
    // Tx bits 7-13 (bit 7 only for protocol v2 and higher)
    encodeByteStream(FirmataStream, sizeof(portData), (uint8_t *) (&portData), sizeof(portData));
}

void mFirmata::parse(nStream *stream, uint8_t inputData) {
    uint8_t command;
#ifdef FORWARD_NRS
    if (stream->flag & FLAG_FORWARD) {
        stream->forward(inputData);
        if (inputData == END_SYSEX || rtos::ticks() > stream->tick_forward) {
            stream->closeForward();
        }
        return;
    }
    if (forward > 0) {
        board.forwardMessage(forward, inputData);
        if (inputData == END_SYSEX + forward) {
            forward = 0;
        }
        return;
    }
#endif
    if (parsingSysex) {
        if (inputData == END_SYSEX) {
            // stop sysex byte
            parsingSysex = false;
            // fire off handler function
            processSysexMessage(stream);
            stream->flag &= ~FLAG_SYSEX;
        } else if (inputData == 0xFA) {
            // stop sysex byte
            parsingSysex = false;
            u16 crc1 = 0, crc = 0;
            if (sysexBytesRead > 3) {
                crc1 = (dataBuffer[sysexBytesRead - 1] << 14) + (dataBuffer[sysexBytesRead - 2] << 7) +
                       dataBuffer[sysexBytesRead - 3];
                crc = crc_16(dataBuffer + 1, sysexBytesRead - 4, 0);
                sysexBytesRead -= 3;
            }
            if (crc == crc1) {
                // fire off handler function
                processSysexMessage(stream);
            }
            stream->flag &= ~FLAG_SYSEX;
        } else {
            // normal data byte - add to buffer
            bufferDataAtPosition(stream, inputData, sysexBytesRead);
            ++sysexBytesRead;
        }
    } else if ((waitForData > 0) && (inputData < 128)) {
        --waitForData;
        bufferDataAtPosition(stream, inputData, waitForData);
        if ((waitForData == 0) && executeMultiByteCommand) { // got the whole message
            switch (executeMultiByteCommand) {
#ifdef FIRMATA_FAST
                case ANALOG_MESSAGE:
                    if (currentAnalogCallback)
                    {
                        (*currentAnalogCallback)(currentAnalogCallbackContext, stream,
                                                 multiByteChannel,
                                                 (uint16_t)(dataBuffer[0] << 7) + dataBuffer[1]);
                    }
                    break;
                case DIGITAL_MESSAGE:
                    if (currentDigitalCallback)
                    {
                        (*currentDigitalCallback)(currentDigitalCallbackContext, stream,
                                                  multiByteChannel,
                                                  (uint16_t)(dataBuffer[0] << 7) + dataBuffer[1]);
                    }
                    break;
                case SET_PIN_MODE:
                    if (currentPinModeCallback)
                        (*currentPinModeCallback)(currentPinModeCallbackContext, stream, dataBuffer[1], dataBuffer[0]);
                    break;
                case SET_DIGITAL_PIN_VALUE:
                    if (currentPinValueCallback)
                        (*currentPinValueCallback)(currentPinValueCallbackContext, stream, dataBuffer[1],
                                                   dataBuffer[0]);
                    break;
                case REPORT_ANALOG:
                    if (currentReportAnalogCallback)
                        (*currentReportAnalogCallback)(currentReportAnalogCallbackContext, stream, multiByteChannel,
                                                       dataBuffer[0]);
                    break;
                case REPORT_DIGITAL:
                    if (currentReportDigitalCallback)
                        (*currentReportDigitalCallback)(currentReportDigitalCallbackContext, stream, multiByteChannel,
                                                        dataBuffer[0]);
                    break;
#endif
                default:
                    break;
            }
            executeMultiByteCommand = 0;
        }
    } else {
        // remove channel info from command byte if less than 0xF0
        if (inputData < 0xF0) {
            command = inputData & 0xF0;
            multiByteChannel = inputData & 0x0F;
        } else {
            command = inputData;
            // commands in the 0xF* range don't use channel data
        }
        switch (command) {
#ifdef FIRMATA_FAST
            case ANALOG_MESSAGE:
            case DIGITAL_MESSAGE:
            case SET_PIN_MODE:
            case SET_DIGITAL_PIN_VALUE:
                waitForData = 2; // two data bytes needed
                executeMultiByteCommand = command;
                break;
            case REPORT_ANALOG:
            case REPORT_DIGITAL:
                waitForData = 1; // one data byte needed
                executeMultiByteCommand = command;
                break;
            case SYSTEM_RESET:
                systemReset(stream);
                break;
            case REPORT_VERSION:
                if (currentReportVersionCallback)
                    (*currentReportVersionCallback)(currentReportVersionCallbackContext, stream);
                break;
#endif
            case START_SYSEX:
                use_sn = false;
                parsingSysex = true;
                sysexBytesRead = 0;
                break;
            case 0xE0:
                use_sn = true;
                sysexBytesRead = 0;
                break;
            default:
#ifdef FORWARD_NRS
                if (command > START_SYSEX && command < START_SYSEX + FORWARD_NRS) {
                    forward = command - START_SYSEX;
                    board.forwardMessage(forward, 0xf0);
                }
#endif
                break;
        }
    }
}

void mFirmata::processSysexMessage(nStream *stream) {
    size_t end_of_string;
    switch (dataBuffer[0]) { // first byte in buffer is command
        case REPORT_FIRMWARE:
            currentReportFirmwareCallback(stream);
            break;

        case STRING_DATA:
            // const size_t end_of_string = (string_offset + decodeByteStream((sysexBytesRead - string_offset),
            //                                                                &dataBuffer[string_offset]));
            // bufferDataAtPosition('\0', end_of_string); // nullptr terminate the string
            currentStringCallback(stream, (const char *) &dataBuffer[1]);
            break;
        default:
            byte *buffer = (byte *) malloc(sysexBytesRead);
            int len = decodeByteStream(sysexBytesRead, &dataBuffer[1], buffer);
            if (use_sn) {
                sn = *(uint32_t *) buffer;
            }
            sysexCallback(stream, dataBuffer[0], sysexBytesRead - 1, dataBuffer + 1);
            free(buffer);
    }
}

