gastonfeng/bootloader_stm32/mFirmata.cpp
bool mFirmata::bufferDataAtPosition(nStream *stream, const uint8_t data, const size_t pos) {
    bool bufferOverflow = (pos >= dataBufferSize);

    // Notify of overflow condition
    if (bufferOverflow) {
        allowBufferUpdate = true;
        currentDataBufferOverflowCallback(stream);
        // Check if overflow was resolved during callback
        bufferOverflow = (pos >= dataBufferSize);
    }

    // Write data to buffer if no overflow condition persist
    if (!bufferOverflow) {
        dataBuffer[pos] = data;
    }

    return bufferOverflow;
}

void mFirmata::currentReportFirmwareCallback(nStream *FirmataStream) {
    byte *buffer = (byte *) malloc(sizeof(firmwareVersionString) + 3);
    buffer[0] = FIRMWARE_MAJOR_VERSION;
    buffer[1] = FIRMWARE_MINOR_VERSION;
    memcpy(buffer + 2, firmwareVersionString, sizeof(firmwareVersionString));
    sendSysex(FirmataStream, REPORT_FIRMWARE, sizeof(firmwareVersionString) + 2, buffer);
    free(buffer);
}

int mFirmata::decodeByteStream(size_t bytec, const byte *bytev, byte *buf) {
    u8 bits = 7;
    int i = 0, j = 0;
    u8 a;
    while (i < bytec - 1) {
        a = bytev[i] >> (7 - bits);
        a |= (bytev[i + 1] << bits) & 0xff;
        buf[j++] = a;
        i += 1;
        bits -= 1;
        if (bits == 0) {
            bits = 7;
            i += 1;
        }
    }
    return j;
}

void mFirmata::currentStringCallback(nStream *pStream, const char *string) {
}

void mFirmata::currentDataBufferOverflowCallback(nStream *pStream) {
}

void mFirmata::sendAnalog(nStream *pStream, byte i, int i1) {
}

bool mFirmata::getPinMode(byte i) {
    return false;
}

void mFirmata::setPinMode(byte i, int i1) {
}

void mFirmata::sendString(nStream *pStream, const char *string) {
}

#endif
